# Pandas Marge function part 8

`merge` function in Pandas allows us to combine data from different dataframes, enabling us to perform complex data manipulations and analysis.üöÄüêç

In [2]:
import pandas as pd
import numpy as np

In [7]:
# first dataset
delivery = pd.read_csv('deliveries.csv')
delivery.sample(2)

,match_id,inning,batting_team,bowling_team,over,ball,batsman,non_striker,bowler,is_super_over,...,bye_runs,legbye_runs,noball_runs,penalty_runs,batsman_runs,extra_runs,total_runs,player_dismissed,dismissal_kind,fielder
12601,54,1,Kings XI Punjab,Rising Pune Supergiant,4,6,EJG Morgan,WP Saha,SN Thakur,0,...,0,0,0,0,0,0,0,NaN,NaN,NaN
129244,545,1,Kolkata Knight Riders,Delhi Daredevils,6,1,MK Pandey,RV Uthappa,JA Morkel,0,...,0,0,0,0,4,0,4,NaN,NaN,NaN

In [8]:
# Second dataset
match = pd.read_csv('matches.csv')
match.sample(2)

,id,season,city,date,team1,team2,toss_winner,toss_decision,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3
531,532,2015,Pune,2015-04-18,Kings XI Punjab,Kolkata Knight Riders,Kolkata Knight Riders,field,normal,0,Kolkata Knight Riders,0,4,AD Russell,Maharashtra Cricket Association Stadium,SD Fry,CK Nandan,NaN
409,410,2013,Chennai,2013-04-22,Rajasthan Royals,Chennai Super Kings,Rajasthan Royals,bat,normal,0,Chennai Super Kings,0,5,MEK Hussey,"MA Chidambaram Stadium, Chepauk",S Asnani,AK Chaudhary,NaN

In [13]:
# Both dataset rows and columns

print('Delivery shape: ', delivery.shape)
print('Matches shape: ', match.shape)

Delivery shape:  (150460, 21)
Matches shape:  (636, 18)

Now we will marge both datasets through 'id' columns 

- `match_id` is in Delivery dataset
- `id` is in Matches dataset


delivery.merge(
    right: 'DataFrame | Series',
    how: 'MergeHow' = 'inner',
    on: 'IndexLabel | None' = None,
    left_on: 'IndexLabel | None' = None,
    right_on: 'IndexLabel | None' = None,
    left_index: 'bool' = False,
    right_index: 'bool' = False,
    sort: 'bool' = False,
    suffixes: 'Suffixes' = ('_x', '_y'),
    copy: 'bool | None' = None,
    indicator: 'str | bool' = False,
    validate: 'str | None' = None,
)

In [18]:
# Merge

""" 
delivery.merge(
    right: 'DataFrame | Series',
    how: 'MergeHow' = 'inner',
    on: 'IndexLabel | None' = None,
    left_on: 'IndexLabel | None' = None,
    right_on: 'IndexLabel | None' = None,
    left_index: 'bool' = False,
    right_index: 'bool' = False,
    sort: 'bool' = False,
    suffixes: 'Suffixes' = ('_x', '_y'),
    copy: 'bool | None' = None,
    indicator: 'str | bool' = False,
    validate: 'str | None' = None,
)
"""

" \ndelivery.merge(\n    right: 'DataFrame | Series',\n    how: 'MergeHow' = 'inner',\n    on: 'IndexLabel | None' = None,\n    left_on: 'IndexLabel | None' = None,\n    right_on: 'IndexLabel | None' = None,\n    left_index: 'bool' = False,\n    right_index: 'bool' = False,\n    sort: 'bool' = False,\n    suffixes: 'Suffixes' = ('_x', '_y'),\n    copy: 'bool | None' = None,\n    indicator: 'str | bool' = False,\n    validate: 'str | None' = None,\n)\n"

In [21]:
# in `delivery` merge `match`  left_on => detaset given on left, right_on => dataset given on right
new_dataset = delivery.merge(match,left_on='match_id',right_on='id')
new_dataset.sample(2)

,match_id,inning,batting_team,bowling_team,over,ball,batsman,non_striker,bowler,is_super_over,...,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3
73350,312,1,Royal Challengers Bangalore,Delhi Daredevils,3,3,AB McDonald,CA Pujara,IK Pathan,0,...,normal,0,Royal Challengers Bangalore,20,0,AB de Villiers,M Chinnaswamy Stadium,S Asnani,S Ravi,NaN
9084,39,1,Sunrisers Hyderabad,Delhi Daredevils,15,3,Yuvraj Singh,MC Henriques,A Mishra,0,...,normal,0,Delhi Daredevils,0,6,Mohammed Shami,Feroz Shah Kotla,YC Barde,Nitin Menon,NaN

In [25]:
# Delivery shape:       (150460, 21)
# Matches shape:        (636, 18)
# after merge shape is  (150460, 39)

print(new_dataset.shape)
type(new_dataset)

(150460, 39)

pandas.core.frame.DataFrame

In [ ]:
# season wise hmary her batsman nay kitny runs bnae

In [28]:
new_dataset.groupby('batsman')['batsman_runs'].sum()

batsman
A Ashish Reddy     280
A Chandila           4
A Chopra            53
A Choudhary         25
A Flintoff          62
                  ...
YV Takawale        192
Yashpal Singh       47
Younis Khan          3
Yuvraj Singh      2591
Z Khan             117
Name: batsman_runs, Length: 461, dtype: int64

### Lets understand the task first 

#### Calculate the runs scored by each batsman in each season - season wise runs

To achieve this, we will follow these steps:

- Group the data based on the 'season' column.
- Within season group, further group the data based on the 'batsman' column. (inside the season grop)
- Calculate the sum of runs scored by each batsman in each season.


<!-- season wise hmary her batsman nay kitny runs bnae

- groups create kro gay on the bases of season
- phr season k under group create kro gay on the bases of batsman
- phr batsman runs k oper sum lgao gay
 -->

## Understand the full code, step by step

Let's break down the given code step by step and provide a detailed explanation for each part:

Step 1: Import necessary libraries and modules
Before running the provided code, you need to ensure that you have the required libraries imported. Assuming you have already imported the necessary libraries like Pandas, the code can be executed.

Step 2: Grouping and Aggregating the Data
```
new_dataset.groupby(['season','batsman'])['batsman_runs'].sum()
```

In this step, the `new_dataset` DataFrame is being grouped by two columns: 'season' and 'batsman'. The `groupby` method is used to group the data based on these two columns. The column 'batsman_runs' is then selected using square brackets `['batsman_runs']` to get the 'batsman_runs' values corresponding to each group. The `sum()` function is applied to each group, which calculates the total 'batsman_runs' for each 'season' and 'batsman' combination.

Step 3: Sorting the Data in Descending Order
```
.sort_values(ascending=False)
```

After grouping and summing, the data is sorted in descending order based on the calculated sum of 'batsman_runs'. The `sort_values` method is used with `ascending=False` to sort the data in descending order.

Step 4: Resetting the Index
```
.reset_index()
```

The index of the DataFrame is reset after sorting. This step ensures that the resulting DataFrame maintains a proper index order, and the previous index becomes a regular column.

Step 5: Dropping Duplicates Based on 'season' Column
```
.drop_duplicates(subset='season',keep='first')
```

Since the data is sorted in descending order of the total 'batsman_runs', there might be multiple entries for the same 'season'. This step drops duplicate rows based on the 'season' column while keeping only the first occurrence of each 'season'. It retains the entry with the highest 'batsman_runs' for each 'season'.

Step 6: Sorting the Data Based on 'season' and 'batsman'
```
.sort_values('season')[['season','batsman']]
```

The final step is to sort the DataFrame again, but this time based on the 'season' column in ascending order. Additionally, only the 'season' and 'batsman' columns are retained in the final result. The `[['season','batsman']]` part is used to select these two columns specifically.

In summary, the given code takes a DataFrame named `new_dataset`, groups the data by 'season' and 'batsman', calculates the total 'batsman_runs' for each group, sorts the data in descending order of the sum of 'batsman_runs', drops duplicates based on the 'season' column while keeping the first occurrence for each 'season', and finally sorts the data based on the 'season' column in ascending order while keeping only the 'season' and 'batsman' columns in the final result.

In [29]:
# Group the data based on the 'season' column.

new_dataset.groupby('season')['batsman_runs'].sum()

season
2008    16809
2009    15376
2010    17754
2011    19928
2012    21322
2013    21487
2014    17943
2015    17427
2016    17963
2017    17920
Name: batsman_runs, dtype: int64

In [32]:
# Within season group, further group the data based on the 'batsman' column. (inside the season grop)

new_dataset.groupby(['season','batsman'])['batsman_runs'].sum()
# type(new_dataset.groupby(['season','batsman'])['batsman_runs'].sum()) # multi index series
# output 
# 1- season
# 2- batsman
# 3- runs

season  batsman
2008    A Chopra              42
        A Kumble              13
        A Mishra              37
        A Mukund               0
        A Nehra                3
                            ...
2017    Washington Sundar      9
        YK Pathan            143
        YS Chahal             13
        Yuvraj Singh         252
        Z Khan                 4
Name: batsman_runs, Length: 1531, dtype: int64

#### We need to find

- Who are the top batsmen in each season, those who scored the highest runs.?


<!--  season main top batsman kon hain?
      jinhon nay sab say zyada runs bnae
 -->

In [35]:
# sort values in descending order
new_dataset.groupby(['season','batsman'])['batsman_runs'].sum().sort_values(ascending=False)

season  batsman
2016    V Kohli        973
        DA Warner      848
2013    MEK Hussey     733
2012    CH Gayle       733
2013    CH Gayle       720
                      ...
2017    MM Patel         0
2012    AC Blizzard      0
2011    AB Dinda         0
2017    AD Nath          0
2008    L Balaji         0
Name: batsman_runs, Length: 1531, dtype: int64

In [36]:
# reset_index to convert on dataframe
new_dataset.groupby(['season','batsman'])['batsman_runs'].sum().sort_values(ascending=False).reset_index()

      season      batsman  batsman_runs
0       2016      V Kohli           973
1       2016    DA Warner           848
2       2013   MEK Hussey           733
3       2012     CH Gayle           733
4       2013     CH Gayle           720
...      ...          ...           ...
1526    2017     MM Patel             0
1527    2012  AC Blizzard             0
1528    2011     AB Dinda             0
1529    2017      AD Nath             0
1530    2008     L Balaji             0

[1531 rows x 3 columns]

In [45]:
# drop duplicates - > keep='first', because we sorted value and have top batsmans in every season how make more runs

new_dataset.groupby(['season','batsman'])['batsman_runs'].sum().sort_values(ascending=False).reset_index().drop_duplicates(subset='season',keep='first')

    season       batsman  batsman_runs
0     2016       V Kohli           973
2     2013    MEK Hussey           733
3     2012      CH Gayle           733
6     2014    RV Uthappa           660
7     2017     DA Warner           641
9     2010  SR Tendulkar           618
10    2008      SE Marsh           616
11    2011      CH Gayle           608
14    2009     ML Hayden           572
17    2015     DA Warner           562

In [47]:
# again sort values in the base of season Descending order

new_dataset.groupby(['season','batsman'])['batsman_runs'].sum().sort_values(ascending=False).reset_index().drop_duplicates(subset='season',keep='first').sort_values('season')

    season       batsman  batsman_runs
10    2008      SE Marsh           616
14    2009     ML Hayden           572
9     2010  SR Tendulkar           618
11    2011      CH Gayle           608
3     2012      CH Gayle           733
2     2013    MEK Hussey           733
6     2014    RV Uthappa           660
17    2015     DA Warner           562
0     2016       V Kohli           973
7     2017     DA Warner           641

#### Now we need only seasons and batsman names

In [48]:
# Final result

new_dataset.groupby(['season','batsman'])['batsman_runs'].sum().sort_values(ascending=False).reset_index().drop_duplicates(subset='season',keep='first').sort_values('season')[['season','batsman']]

    season       batsman
10    2008      SE Marsh
14    2009     ML Hayden
9     2010  SR Tendulkar
11    2011      CH Gayle
3     2012      CH Gayle
2     2013    MEK Hussey
6     2014    RV Uthappa
17    2015     DA Warner
0     2016       V Kohli
7     2017     DA Warner